/// Тетрис на коленке.
///----------------------------------------------------------------------------|
/// C++17
/// исходник в utf-8
///----------------------------------------------------------------------------:

#include "tests.h"


///----------------------------------------------------------------------------|
/// Старт.
///----------------------------------------------------------------------------:
int main()
{
    IDevice::create_device_console();

    setlocale(0, "");
    DEVICE << L"ЯTeTRis-2023\n";

    try
    {   tests();
    }
    catch(const CustomException& e)
    {   DEVICE << e.what();
    }

    DEVICE << "TETRIS FINISH!\n";
    DEVICE.pause_press_enter(L"PRESS ENTER\n");
}
