#ifndef CONFIG_H
#define CONFIG_H

#include "myl.h"

///----------------------------------------------------------------------------|
/// Конфигурация программы.
///----------------------------------------------------------------------------:
struct Config
{
    unsigned H = 20 ; /// Высота доски.
    unsigned W = 21 ; /// Ширина доски.
    wchar_t  C = '.'; /// Символ заполнения.

    unsigned HK = 13; /// Высота корзины.
    unsigned WK =  7; /// Ширина корзины.

    void load_from_file(){ /* ... */ }
};

const Config cfg;

#endif // CONFIG_H
