#ifndef VSCR_H
#define VSCR_H

#include "config.h"

///----------------------------------------------------------------------------|
/// Виртуальный экран.
///----------------------------------------------------------------------------:
struct  VScreen : public myl::Mat2D
{       VScreen() : Mat2D(cfg.W, cfg.H, cfg.C)
        {
        }

    ///--------------------------------------|
    /// Кукиш фовард декларейшн!             |
    ///--------------------------------------:
    template<typename T>
    void write(Vec2u pos, const T& m)
    {   myl::Mat2D::write(pos, m.get_mat());
    }
};

///----------------------------------------------------------------------------|
/// Конкретный способ или девайс вывода на монитор.
///----------------------------------------------------------------------------:
struct  Hard
{
    Hard& operator<<(const VScreen& scr)
    {   for(const auto& s : scr.get_mat())
        {   std::wcout << s << '\n';
        }   std::wcout      << '\n';
        return  *this;
    }
};

#endif // VSCR_H
